에셋 관리는 Import 폴더에 넣고 Export를 이용해서 서로 구글Drive를 통해서 공유한다. 
(meta file을 포함하지 않는 불상사를 방지하기 위하여)
Layer & tag & projectSetting 에 포함되는 (뿐만 아니라 프로젝트 전체에 영향을 미치는 모든 작업들에 대하여) 작업들은
담당자 한 명이 맡아서 작업한다. --> 변경사항이 필요하다면 요청한다.
Unity에서 작업 시에 같은 Scene을 작업해서는 안된다. 이를 위해 각각의 자신 이름 폴더 안에서만 작업한다.
Script를 생성 시 이름이 똑같으면 충돌이 발생한다. namespace를 이용해서 충돌이 일어나지 않도록 한다.
(using 을 이용해서 불러오면 된다.)

----깃허브 작업

Develop에서 각각의 로컬 분기를 분기하여 작업을 실시한다. 
작업을 완료하면 Develop에 PullRequest를 요청한다. Develop에 붙인 분기는 삭제해준다. 
작업을 시작할 때 마다 Develop에서 분기를 따서 시작한다. 
Develop를 master에 merge 하는 작업은 중요한 마일스톤마다 실시한다. (무결성을 보장하기 위해 철저히 테스트 후 실시한다.)

----tag 및 layer 분담 --> 손유정 :: 0~17  정재훈: 18~31 로 분담한다. 
